{
    "TestEvent1": {
        "NAME": "Test Event",
        "DESCRIPTIONS": [
            "#r~State~ #r1",
            "#g@State@ #g2",
            "#bState #b3",
            "#pYOU #pLEFT"
        ],
        "OPTIONS": [
            "#y[State #y1] Get a Test Relic",
            "#y[State #y2]",
            "#y[State #y3]",
            "#y[Leave]"
        ]
    },
    "TestShrine1": {
        "NAME": "Test Shrine",
        "DESCRIPTIONS": [
            "#r~State~ #r1",
            "#g@State@ #g2",
            "#bState #b3",
            "#pYOU #pLEFT"
        ],
        "OPTIONS": [
            "#y[State #y1] Get a Test Relic",
            "#y[State #y2]",
            "#y[State #y3]",
            "#y[Leave]"
        ]
    },
    "InjuredMage": {
        "NAME": "Injured Mage",
        "DESCRIPTIONS": [
            "In a back alley you encounter a heavily injured mage lying on the floor. Some potions may help, but you are unsure what effects they will have.",
            "You empty the potion into the mage's mouth. NL Nothing happens. It seems you were too late.",
            "You empty the block potion into the mage's mouth. NL As you step back, the mage's body crystallizes and a small chunk breaks off.",
            "You pick up the small crystal chunk.",
            "You empty the dexterity potion into the mage's mouth. NL As you step back the mage vanishes in a blinding flash of light. As your vision returns you find a green orb of light where the mage had been.",
            "The orb of light enters your body and you feel light on your feet",
            "You empty the elixer into the mage's mouth. NL The mage immediately springs to life and offers you a reward for your help.",
            "The mage casts a spell and you feel more powerful.",
            "The mage casts a spell and you feel light on your feet",
            "The mage casts a spell and you feel healthy.",
            "You empty the energy potion into the mage's mouth. NL As you step back the mage's wounds begin to give off a faint glow and rapidly heal. The mage does not wake up but you feel lucky as you continue down the alley.",
            "You empty the explosive potion into the mage's mouth. NL The mages body immediately explodes in your face",
            "You empty the fire potion into the mage's mouth. NL As you step back the mage's body bursts into flames. Looking at the flames gives you a terrible headache.",
            "You empty the poison potion into the mage's mouth. NL The mage's body erupts into a cloud of green smoke. Inhaling the smoke makes you feel ill.",
            "You empty the regen potion into the mage's mouth. NL As you step back the mage wakes up and casts a healing spell on you as thanks.",
            "You empty the strength potion into the mage's mouth. NL As you step back the mage vanishes in a blinding flash of light. As your vision returns you find a red orb of light where the mage had been.",
            "You empty the swift potion into the mage's mouth. NL As you step back the mage vanishes in a blinding flash of light. As your vision returns you find a blue orb of light where the mage had been.",
            "You empty the weak potion into the mage's mouth. NL The mage's body immediately shrivels. As you turn to leave the mage springs to life and grabs you. You feel your energy being drained. The mage vanishes after draining your energy.",
            "You continue walking past the mage.",
            "The orb enters your body and you feel more powerful."
        ],
        "OPTIONS": [
            "[Help] Give your first potion",
            "[Help] Give your second potion",
            "[Help] Give your third potion",
            "[Locked] No potion to give",
            "[Take] #gObtain #ga #gRelic",
            "[Absorb] #gGain #g1 #gDexterity",
            "[Power] #gGain #g1 Strength",
            "[Protection] #gGain #g1 Dexterity",
            "[Vigor] #gGain #g7 #gMax #gHP",
            "[Leave] #gThe #gnext #g? #groom #gyou #gvisit #gwill #gcontain #ga #gchest",
            "[Leave] #rTake #r",
            " #rdamage",
            "[Leave] #rBecome #rCursed #r- #Guilt",
            "[Leave] #rBecome #rCursed #r- #Contamination",
            "[Leave] #gHeal #gto #gfull #gHP",
            "[Absorb] #gGain #g1 #gStrength",
            "[Absorb] #gDuplicate #ga #gcard #gin #gyour #gdeck",
            "[Leave] #rLose #r7 #rMax #rHP",
            "[Leave] Ignore the mage",
            "[Leave]"
        ]
    }
}